Results/Verifications/S2427/bottleneck-determination/update_index/threads-1/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=1 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-typ
e=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 1 tps: 357.42 qps: 357.42 (r/w/o: 0.00/349.53/7.90) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 358.71 qps: 358.71 (r/w/o: 0.00/348.41/10.30) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 361.40 qps: 361.40 (r/w/o: 0.00/352.10/9.30) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 353.70 qps: 353.70 (r/w/o: 0.00/344.60/9.10) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 332.30 qps: 332.30 (r/w/o: 0.00/323.80/8.50) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 329.40 qps: 329.40 (r/w/o: 0.00/321.40/8.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 1 tps: 330.60 qps: 330.60 (r/w/o: 0.00/322.30/8.30) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 1 tps: 332.50 qps: 332.50 (r/w/o: 0.00/324.30/8.20) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 1 tps: 330.00 qps: 330.00 (r/w/o: 0.00/322.20/7.80) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           33023
        other:                           861
        total:                           33884
    transactions:                        33884  (338.82 per sec.)
    queries:                             33884  (338.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0052s
    total number of events:              33884

Latency (ms):
         min:                                    1.28
         avg:                                    2.95
         max:                                   22.60
         95th percentile:                        3.62
         sum:                                99928.22

Threads fairness:
    events (avg/stddev):           33884.0000/0.00
    execution time (avg/stddev):   99.9282/0.00


real    1m40.088s
user    0m0.833s
sys     0m2.313s